# Exploring Data with Pandas: Fundamentals

In [107]:
# Import libraries
import pandas as pd
import numpy as np

In [108]:
# Load data
df = pd.read_csv('Global 500_2017.csv')
df.head()

,Rank,Company Name,Country,Number of Employees,Previous Rank,Revenues($millions),Revenue Change,Profits($millions),Profit Change,Assets($millions)
0,1,Walmart,USA,"2,300,000",1,"$485,873",0.8%,"$13,643.0",-7.2%,"$198,825"
1,2,State Grid,China,"926,067",2,"$315,199",-4.4%,"$9,571.3",-6.2%,"$489,838"
2,3,Sinopec Group,China,"713,288",4,"$267,518",-9.1%,"$1,257.9",-65.0%,"$310,726"
3,4,China National Petroleum,China,"1,512,048",3,"$262,573",-12.3%,"$1,867.5",-73.7%,"$585,619"
4,5,Toyota Motor,Japan,"364,445",8,"$254,694",7.7%,"$16,899.3",-12.3%,"$437,575"

In [109]:
# Analyze data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Rank                 500 non-null    int64
 1   Company Name         500 non-null    object
 2   Country              500 non-null    object
 3   Number of Employees  500 non-null    object
 4   Previous Rank        500 non-null    object
 5   Revenues($millions)  500 non-null    object
 6   Revenue Change       500 non-null    object
 7   Profits($millions)   500 non-null    object
 8   Profit Change        500 non-null    object
 9   Assets($millions)    500 non-null    object
dtypes: int64(1), object(9)
memory usage: 39.2+ KB

In [110]:
df.shape

(500, 10)

In [111]:
df.count()

Rank                   500
Company Name           500
Country                500
Number of Employees    500
Previous Rank          500
Revenues($millions)    500
Revenue Change         500
Profits($millions)     500
Profit Change          500
Assets($millions)      500
dtype: int64

In [112]:
# Replace empty with null values
df['Profits($millions)'] = df['Profits($millions)'].replace('-', np.nan)
df['Revenue Change'] = df['Revenue Change'].replace('-', np.nan)
df['Profit Change'] = df['Profit Change'].replace('-', np.nan)
df['Previous Rank'] = df['Previous Rank'].replace('-', np.nan)

In [113]:
# Change the types
df['Revenues($millions)'] = df['Revenues($millions)'].str.replace('$', '').str.replace(',', '').astype('float')
df['Profits($millions)'] = df['Profits($millions)'].str.replace('$', '').str.replace(',', '').astype('float')
df['Assets($millions)'] = df['Assets($millions)'].str.replace('$', '').str.replace(',', '').astype('float')
df['Profit Change'] = df['Profit Change'].str.replace('%', '').str.replace(',', '').astype('float')
df['Number of Employees'] = df['Number of Employees'].str.replace(',', '').astype('float')
df['Revenue Change'] = df['Revenue Change'].str.replace('%', '').astype('float')
df['Previous Rank'] = df['Previous Rank'].astype('float')

In [114]:
rank_change = df['Previous Rank'] - df['Rank']
rank_change_max = rank_change.max()
rank_change_min = rank_change.min()
print(rank_change_max, rank_change_min)

226.0 -199.0

In [115]:
rank = df['Rank']
rank.describe()

count    500.000000
mean     250.500000
std      144.481833
min        1.000000
25%      125.750000
50%      250.500000
75%      375.250000
max      500.000000
Name: Rank, dtype: float64

In [116]:
prev_rank = df['Previous Rank']
prev_rank.describe()

count    467.000000
mean     237.830835
std      139.211279
min        1.000000
25%      117.500000
50%      236.000000
75%      355.500000
max      500.000000
Name: Previous Rank, dtype: float64

In [117]:
print(df.max(numeric_only=True))

Rank                       500.0
Number of Employees    2300000.0
Previous Rank              500.0
Revenues($millions)     485873.0
Revenue Change             442.3
Profits($millions)       45687.0
Profit Change            89095.0
Assets($millions)      3473238.0
dtype: float64

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Rank                 500 non-null    int64
 1   Company Name         500 non-null    object
 2   Country              500 non-null    object
 3   Number of Employees  500 non-null    float64
 4   Previous Rank        467 non-null    float64
 5   Revenues($millions)  500 non-null    float64
 6   Revenue Change       498 non-null    float64
 7   Profits($millions)   499 non-null    float64
 8   Profit Change        436 non-null    float64
 9   Assets($millions)    500 non-null    float64
dtypes: float64(7), int64(1), object(2)
memory usage: 39.2+ KB

In [119]:
df.eq('').sum()

Rank                   0
Company Name           0
Country                0
Number of Employees    0
Previous Rank          0
Revenues($millions)    0
Revenue Change         0
Profits($millions)     0
Profit Change          0
Assets($millions)      0
dtype: int64

In [120]:
df.describe(include='all')

,Rank,Company Name,Country,Number of Employees,Previous Rank,Revenues($millions),Revenue Change,Profits($millions),Profit Change,Assets($millions)
count,500.000000,500,500,5.000000e+02,467.000000,500.000000,498.000000,499.000000,436.000000,5.000000e+02
unique,NaN,500,35,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,Walmart,USA,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,1,132,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,250.500000,NaN,NaN,1.355357e+05,237.830835,55416.358000,4.538353,3055.203206,208.064450,2.436323e+05
std,144.481833,NaN,NaN,1.708994e+05,139.211279,45725.478963,28.549067,5171.981071,4267.811828,4.851937e+05
min,1.000000,NaN,NaN,1.000000e+03,1.000000,21609.000000,-67.300000,-13038.000000,-793.700000,3.717000e+03
25%,125.750000,NaN,NaN,4.324075e+04,117.500000,29003.000000,-5.900000,556.950000,-22.775000,3.658850e+04
50%,250.500000,NaN,NaN,9.425100e+04,236.000000,40236.000000,0.550000,1761.600000,-0.350000,7.326150e+04
75%,375.250000,NaN,NaN,1.695972e+05,355.500000,63926.750000,6.975000,3954.000000,17.700000,1.805640e+05
max,500.000000,NaN,NaN,2.300000e+06,500.000000,485873.000000,442.300000,45687.000000,89095.000000,3.473238e+06

In [121]:
top10_rank_revenue = df[["Rank", "Company Name", "Revenues($millions)"]].head(10)
top10_rank_revenue

   Rank              Company Name  Revenues($millions)
0     1                   Walmart             485873.0
1     2                State Grid             315199.0
2     3             Sinopec Group             267518.0
3     4  China National Petroleum             262573.0
4     5              Toyota Motor             254694.0
5     6                Volkswagen             240264.0
6     7         Royal Dutch Shell             240033.0
7     8        Berkshire Hathaway             223604.0
8     9                     Apple             215639.0
9    10               Exxon Mobil             205004.0